martinbaillie.org
#+seq_todo: TODO DRAFT DONE
#+property: header-args :eval never-export
#+startup: indent
#+author: Martin Baillie
#+hugo_base_dir: ./

** DONE Fieldnotes :meta:
CLOSED: [2020-01-03 Fri 21:45]
:PROPERTIES:
:EXPORT_FILE_NAME: fieldnotes
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :tldr This site's existential justification.
:END:
Well here we are! I had held off from spewing words onto the internet in
long-form until now. That I have made it this far with a new site and first post
has been the culmination of:

1. The compound guilt felt as a practiced user of other people's technical
   writing to my professional advantage.
2. The accidental consumption of multiple /"why you should write a technical
   blog"/-themed posts in quickfire succession from my feeds.
3. The turn of a new year (though I won't go as far as to say it is a
  resolution).

I have opted to refer to the writing section /Fieldnotes/ as because I predict
the [[https://en.wikipedia.org/wiki/Fieldnotes][definition]] will best represent the style of content that will unfold. That
is, the posts will likely be overwhelmingly technical in nature and cover
something I have learned or been playing with recently in the hope that someone
else finds some value in it or, at the very least, help me to better understand
the topic by way of the Feynman technique.

I personally prefer reading posts with technical content. The same goes for
conference presentations as it happens (especially those that dare to live
demo). So while I can't promise I won't waffle on in the posts, I will commit to
most or all of them having something technically concrete to add to the greater
internet—new OSS releases, how-tos, gotchas and so on. I've even added a =tl;dr=
construct to help the reader decide if they will get value from the gist.

If nothing else, I'm looking forward to having a space to share content and
contact information in a decentralised manner, off social platforms. I've made
the promise to myself that I'll keep the writing consistent for at least a year
and I'm optimistic that the posts will be more coherent and valuable to me than
just another random =.org= file in my Dropbox.

The site itself is generated with an old familiar: [[https://gohugo.io][Hugo]] (even though I'm reading
good things about [[https://www.getzola.org/][Zola]]). I've used Hugo for many years to produce internal
documentation sites at my day jobs. There's also something to be said about the
special synergy you get when combining Hugo and Emacs Org mode ([[https://ox-hugo.scripter.co/][ox-hugo]]). Well
maybe there is something to be said. If I do manage to keep this up then I'm
sure I will write one of those clichéd meta posts about the whole build and
deploy setup, or at least a colophon section.

